; domain
;Header and description

(define (domain block_world)

    ;remove requirements that are not needed
    (:requirements :typing :negative-preconditions :conditional-effects)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        location locatable - object
        block agent - locatable
        static dynamic - block
        robot - agent
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (at ?obj - locatable ?loc - location) ; Object ?obj is at location ?loc)
        (on ?block1 - block ?block2 - block)
        (at-top ?block - block) ; Block ?block is at the top of its stack
        (gripper-empty)
        (holding ?robot - robot ?block - block) ; Robot ?robot is holding block ?block
        (path-blocked-from-to ?from - location ?to - location) ; Path from ?from to ?to is blocked
    )

    (:functions ;todo: define numeric functions here
    )

    ;define actions here
    (:action move
            :parameters (?robot - robot
                         ?from - location
                         ?to - location)

            :precondition (and
                (at ?robot ?from)
                (not (path-blocked-from-to ?from ?to)))

            :effect (and
                (not (at ?robot ?from))
                (at ?robot ?to))
    )

    (:action grasp
        :parameters (?robot - robot
                     ?block - dynamic
                     ?loc - location)

        :precondition (and
                        (at ?robot ?loc)
                        (at ?block ?loc)
                        (gripper-empty)
                        (at-top ?block)
                      )

        :effect (and
                    (not (at ?block ?loc))
                    (holding ?robot ?block)
                    (not (gripper-empty))
                    (not (at-top ?block))
                    (forall (?below_block - block)
                        (when (on ?block ?below_block)
                            (at-top ?below_block)
                        )
                    )
                )
    )

    (:action place
        :parameters (?robot - robot
                     ?block - dynamic
                     ?loc - location)

        :precondition (and
                        (at ?robot ?loc)
                        (holding ?robot ?block)
                        (not (gripper-empty))
                      )

        :effect (and
                    (gripper-empty)
                    (not (holding ?robot ?block))
                    (at ?block ?loc)
                    (at-top ?block)
                    (forall (?below_block - block)
                        (when (and
                                (at ?below_block ?loc)
                                (at-top ?below_block)
                                (on ?block ?below_block)
                              )
                            (and
                                (not (at-top ?below_block))
                                (on ?block ?below_block)
                            )
                        )
                    )
                )

    )
)

; problem
(define (problem blocks_1) (:domain block_world)
    (:objects
        d1 d2 d3 - dynamic
        s1 s2 - static
        rob - robot
        p0 p1 p2 p3 p4 p5 p6 p9 p10 - location
    )

    (:init
        ;todo: put the initial state's facts and numeric values here
        (at rob p0)
        (at d1 p1)
        (at d2 p1)
        (on d2 d1)
        (at d3 p1)
        (on d3 d2)
        (at s1 p9)
        (at-top d3)
        (at-top s1)
        (gripper-empty)
    )

    (:goal (and
                ;todo: put the goal condition here
                (at d1 p4)
                (at d2 p5)
                (at d3 p6)
           )
    )

    ;un-comment the following line if metric is needed
    ;(:metric minimize (???))
)

; plan
1. (move rob p0 p1)
   deleted: (at rob p0)
   added: (at rob p1)
   goals met: 0 of 3
2. (grasp rob d3 p1)
   deleted: (at d3 p1) (gripper-empty) (at-top d3)
   added: (holding rob d3) (at-top d2)
   goals met: 0 of 3
3. (move rob p1 p6)
   deleted: (at rob p1)
   added: (at rob p6)
   goals met: 0 of 3
4. (place rob d3 p6)
   deleted: (holding rob d3)
   added: (gripper-empty) (at d3 p6) (at-top d3)
   goals met: 1 of 3
5. (move rob p6 p1)
   deleted: (at rob p6)
   added: (at rob p1)
   goals met: 1 of 3
6. (grasp rob d2 p1)
   deleted: (at d2 p1) (gripper-empty) (at-top d2)
   added: (holding rob d2) (at-top d1)
   goals met: 1 of 3
7. (move rob p1 p5)
   deleted: (at rob p1)
   added: (at rob p5)
   goals met: 1 of 3
8. (place rob d2 p5)
   deleted: (holding rob d2)
   added: (gripper-empty) (at d2 p5) (at-top d2)
   goals met: 2 of 3
9. (move rob p5 p1)
   deleted: (at rob p5)
   added: (at rob p1)
   goals met: 2 of 3
10. (grasp rob d1 p1)
   deleted: (at d1 p1) (gripper-empty) (at-top d1)
   added: (holding rob d1)
   goals met: 2 of 3
11. (move rob p1 p4)
   deleted: (at rob p1)
   added: (at rob p4)
   goals met: 2 of 3
12. (place rob d1 p4)
   deleted: (holding rob d1)
   added: (gripper-empty) (at d1 p4) (at-top d1)
   goals met: 3 of 3
